Enums/упВидыГрузов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыГрузов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Груз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассируемаяЦенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыГрузов/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.упВидыГрузов.Груз);
	Если ПолучитьФункциональнуюОпцию("упИспользуютсяУслугиИнкассации") Тогда
		ДанныеВыбора.Добавить(Перечисления.упВидыГрузов.ИнкассируемаяЦенность);
	КонецЕсли; 
	Если ПолучитьФункциональнуюОпцию("упВедетсяУчетТары") Тогда
		ДанныеВыбора.Добавить(Перечисления.упВидыГрузов.Тара);
	КонецЕсли; 
	
КонецПроцедуры
